app/controllers/index_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`mid` = 'ua3c4c90fa2133580787a141316e73bcc'  ORDER BY `users`.`id` ASC LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 26 LIMIT 1 FOR UPDATE
INSERT INTO `users` (`name`, `mid`, `level`, `created_at`, `updated_at`) VALUES ('first_name', 'ua3c4c90fa2133580787a141316e73bcc', 'a-1', '2016-04-23 09:01:33', '2016-04-23 09:01:33')
---
  def index
    http_request_body = request.raw_post
    hash = OpenSSL::HMAC::digest(OpenSSL::Digest::SHA256.new, CHANNEL_SECRET, http_request_body)
    signature = Base64.strict_encode64(hash)
    if signature != request.headers["X-LINE-CHANNELSIGNATURE"]
        render json: [], status: :ng
        return
    end

    from = params[:result][0][:content][:from]
    message_type = params[:result][0][:content]["contentType"]

    #全員へメッセージを送る
    #if from == "ua3c4c90fa2133580787a141316e73bcc"
    #  users = User.all
    #  user_mids = Array.new
    #  users.each do |user_all|
    #    user_mids.push(user_all.mid)
    #  end
    #  output_message(user_mids, "新機能追加！！\n\n「マッチング拒否設定」を追加したよ！\n\n通知がうるさかったり、勝手にマッチングして欲しくない人はこの機能を設定しよう！\n\n\n設定方法は、まち子に「拒否設定」って送ってね！")
     # return
   # end

    #食い止め(作業中のみ)
    #output_message(from, "ジュンビチューデース"+"\n\n"+params[:result][0][:content][:text])
    #return

    user = User.by_mid(from).first rescue nil

    admin = User.find(26)

    if !user
      User.create(from, "first_name", "a-1")

UPDATE `users` SET `level` = 'a-4', `partner` = 'u52feef7d66237dc4f20c3c2404f42613', `updated_at` = '2016-05-12 11:55:00' WHERE `users`.`id` = 24
---
        message = "名前が長いよ><\n短くしてくれる？"
      else
        message = text + " が名前でいい？\n\n1. はい\n2. いいえ"
        user.update(level: "a-2", name: text)