app/controllers/pad_rmt_controller.rb

  def index
    account = Account.by_image_name(params[:url]).first rescue nil
---
SELECT  `accounts`.* FROM `accounts` WHERE `accounts`.`image_name` = '0606-1908-19-024.jpg'  ORDER BY `accounts`.`id` ASC LIMIT 1

  def publish
    pp `echo '' > script/pad/image_name.lua`
    pp `echo 'IMAGE_NAME="#{params[:url]}"' > script/pad/image_name.lua`
    account = nil
    if !Account.exists?(:image_name => params[:url])
      account = Account.create_account(params[:url], params[:customer])
---
SELECT  1 AS one FROM `accounts` WHERE `accounts`.`image_name` = '0420-1033-26-019.jpg' LIMIT 1
INSERT INTO `accounts` (`image_name`, `customer_name`, `created_at`, `updated_at`) VALUES ('0606-1908-19-024.jpg', 'テスト', '2016-06-06 11:35:51', '2016-06-06 11:35:51')